In [1]:
# import the required module / sub-module

In [2]:
import numpy as np # for handling missing data
import pandas as pd # for data manipulation and cleaning
import matplotlib.pyplot as plt # for plotting data records
import seaborn as sns # for advanced visualization

In [3]:
# Load the dataset
df = pd.read_csv(r"C:\Users\payas\Downloads\educational_dataset_india_5000.csv")

In [7]:
# View first few rows
df.head()

,Student ID,Student Name,Age,Gender,State/City,School/Institution Name,Education Level,Stream/Field of Study,Marks Percentage,No. of Students in Class,Scholarship Status
0,SID1,Aryan,8.0,Male,Lucknow,School_85,Postgraduate,Arts,75.33,27,No
1,SID2,Priya,19.0,Mle,Delhi,School_99,Secondary,NaN,52.00,55,Yes
2,SID3,Priya,19.0,Others,Pune,School_91,Higher Secondary,Science,37.96,20,No
3,SID4,Aryan,6.0,Female,Bangalore,School_87,Primary,NaN,45.39,31,No
4,SID5,Pooja,9.0,Female,Lucknow,School_74,Undergraduate,Science,50.53,28,Yes

In [8]:
df.shape

(5000, 11)

In [9]:
# Check structure 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Student ID                5000 non-null   object
 1   Student Name              5000 non-null   object
 2   Age                       4746 non-null   float64
 3   Gender                    5000 non-null   object
 4   State/City                5000 non-null   object
 5   School/Institution Name   5000 non-null   object
 6   Education Level           5000 non-null   object
 7   Stream/Field of Study     2969 non-null   object
 8   Marks Percentage          4828 non-null   float64
 9   No. of Students in Class  5000 non-null   int64
 10  Scholarship Status        5000 non-null   object
dtypes: float64(2), int64(1), object(8)
memory usage: 429.8+ KB

In [10]:
# find the missing value
df.isnull().sum()

Student ID                     0
Student Name                   0
Age                          254
Gender                         0
State/City                     0
School/Institution Name        0
Education Level                0
Stream/Field of Study       2031
Marks Percentage             172
No. of Students in Class       0
Scholarship Status             0
dtype: int64

In [11]:
# Convert column names to lowercase and replace spaces with underscores
df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')

print(df.columns.tolist())

['student_id', 'student_name', 'age', 'gender', 'state/city', 'school/institution_name', 'education_level', 'stream/field_of_study', 'marks_percentage', 'no._of_students_in_class', 'scholarship_status']